app/controllers/critiques_controller.rb

  def create
    @critique = Critique.new(critique_params)
    @critique.user_id = current_user.id
    @critique.product_id = @product.id

    respond_to do |format|
      if @critique.save
---
INSERT INTO "critiques" ("rating", "comment", "user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 4], ["comment", "dis"], ["user_id", 1], ["product_id", 1], ["created_at", "2015-07-07 15:11:01.219435"], ["updated_at", "2015-07-07 15:11:01.219435"]]

  def destroy
    @critique.destroy
---
DELETE FROM "critiques" WHERE "critiques"."id" = ?  [["id", 1]]

    def set_critique
      @critique = Critique.find(params[:id])
---
SELECT  "critiques".* FROM "critiques" WHERE "critiques"."id" = ? LIMIT 1  [["id", 1]]