app/controllers/products_controller.rb

SELECT "critiques".* FROM "critiques" WHERE "critiques"."product_id" = ?  ORDER BY created_at DESC  [["product_id", 1]]
SELECT AVG("critiques"."rating") FROM "critiques" WHERE "critiques"."product_id" = ?  [["product_id", 2]]
---
  def show
    @critiques = Critique.where(product_id: @product.id).order("created_at DESC")

    if @critiques.blank?
      @avg_critique = 0
    else
      @avg_critique = @critiques.average(:rating).round(2)

INSERT INTO "products" ("title", "review", "product", "maker", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_updated_at", "2015-05-06 19:59:14.474225"], ["image_file_name", "Screen_Shot_2015-05-06_at_3.52.21_PM.png"], ["updated_at", "2015-05-06 19:59:14.882060"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)